remalhq/Remal_ArduinoBoards/arch/esp32/1.3.0/boards.txt
#################################################################
#	Modified by Khalid Mansoor AlAwadhi - Remal, 2025
# 	> Changes focused on removing anything not related to the
#	  ESP32C3 as Shabakah is powered by the ESP32C3
# 	> Changes also focused on renaming UI to show Shabakah (Founders Edition)
#
#	Original files by Espressif systems found here:			
#	> https://raw.githubusercontent.com/espressif/arduino-esp32/gh-pages/package_esp32_index.json
#################################################################

# Official Espressif options
menu.UploadSpeed=Upload Speed
menu.USBMode=USB Mode
menu.CDCOnBoot=USB CDC On Boot
menu.MSCOnBoot=USB Firmware MSC On Boot
menu.DFUOnBoot=USB DFU On Boot
menu.UploadMode=Upload Mode
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM
menu.LoopCore=Arduino Runs On
menu.EventsCore=Events Run On
menu.MemoryType=Memory Type
menu.EraseFlash=Erase All Flash Before Sketch Upload
menu.JTAGAdapter=JTAG Adapter
menu.ZigbeeMode=Zigbee Mode
menu.PinNumbers=Pin Numbering

# Generic definition to be used for USB discovery of CDC/JTAG
esp32_family.name=ESP32 Family Device
esp32_family.hide=true
esp32_family.vid.0=0x303a
esp32_family.pid.0=0x1001
esp32_family.upload_port.0.vid=0x303a
esp32_family.upload_port.0.pid=0x1001
esp32_family.build.board=ESP32_FAMILY

##############################################################
### Boards:												   ###
##############################################################
#
# Shabakah v4
#
##############################################################
remalshabakahv4.name=Shabakah v4
remalshabakahv4.vid.0=0x303A
remalshabakahv4.pid.0=0x1001

remalshabakahv4.bootloader.tool=esptool_py
remalshabakahv4.bootloader.tool.default=esptool_py

remalshabakahv4.upload.tool=esptool_py
remalshabakahv4.upload.tool.default=esptool_py
remalshabakahv4.upload.tool.network=esp_ota

remalshabakahv4.upload.maximum_size=1310720
remalshabakahv4.upload.maximum_data_size=327680
remalshabakahv4.upload.flags=
remalshabakahv4.upload.extra_flags=
remalshabakahv4.upload.use_1200bps_touch=false
remalshabakahv4.upload.wait_for_upload_port=false

remalshabakahv4.serial.disableDTR=false
remalshabakahv4.serial.disableRTS=false

remalshabakahv4.build.tarch=riscv32
remalshabakahv4.build.target=esp
remalshabakahv4.build.mcu=esp32c3
remalshabakahv4.build.core=esp32
remalshabakahv4.build.variant=shabakah_v4
remalshabakahv4.build.board=SHABAKAH_V4
remalshabakahv4.build.bootloader_addr=0x0

remalshabakahv4.build.cdc_on_boot=0
remalshabakahv4.build.f_cpu=160000000L
remalshabakahv4.build.flash_size=4MB
remalshabakahv4.build.flash_freq=80m
remalshabakahv4.build.flash_mode=dio
remalshabakahv4.build.boot=dio
remalshabakahv4.build.partitions=min_spiffs
remalshabakahv4.build.defines=

## IDE 2.0 Seems to not update the value
remalshabakahv4.menu.JTAGAdapter.default=Disabled
remalshabakahv4.menu.JTAGAdapter.default.build.copy_jtag_files=0
remalshabakahv4.menu.JTAGAdapter.builtin=Integrated USB JTAG
remalshabakahv4.menu.JTAGAdapter.builtin.build.openocdscript=esp32c3-builtin.cfg
remalshabakahv4.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
remalshabakahv4.menu.JTAGAdapter.external=FTDI Adapter
remalshabakahv4.menu.JTAGAdapter.external.build.openocdscript=esp32c3-ftdi.cfg
remalshabakahv4.menu.JTAGAdapter.external.build.copy_jtag_files=1
remalshabakahv4.menu.JTAGAdapter.bridge=ESP USB Bridge
remalshabakahv4.menu.JTAGAdapter.bridge.build.openocdscript=esp32c3-bridge.cfg
remalshabakahv4.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

## Remal - Updated to Enabled as default to allow using USB with Arduino Serial calls
remalshabakahv4.menu.CDCOnBoot.default=Enabled
remalshabakahv4.menu.CDCOnBoot.default.build.cdc_on_boot=1
remalshabakahv4.menu.CDCOnBoot.cdc=Disabled
remalshabakahv4.menu.CDCOnBoot.cdc.build.cdc_on_boot=0

# Partitions
remalshabakahv4.menu.PartitionScheme.default= 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
remalshabakahv4.menu.PartitionScheme.default.build.partitions=default

remalshabakahv4.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
remalshabakahv4.menu.PartitionScheme.defaultffat.build.partitions=default_ffat

remalshabakahv4.menu.PartitionScheme.no_fs=No FS 4MB (2MB APP x2)
remalshabakahv4.menu.PartitionScheme.no_fs.build.partitions=no_fs
remalshabakahv4.menu.PartitionScheme.no_fs.upload.maximum_size=2031616

remalshabakahv4.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
remalshabakahv4.menu.PartitionScheme.minimal.build.partitions=minimal

remalshabakahv4.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
remalshabakahv4.menu.PartitionScheme.no_ota.build.partitions=no_ota
remalshabakahv4.menu.PartitionScheme.no_ota.upload.maximum_size=2097152

remalshabakahv4.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
remalshabakahv4.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
remalshabakahv4.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576

remalshabakahv4.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
remalshabakahv4.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
remalshabakahv4.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152

remalshabakahv4.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
remalshabakahv4.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
remalshabakahv4.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576

remalshabakahv4.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
remalshabakahv4.menu.PartitionScheme.huge_app.build.partitions=huge_app
remalshabakahv4.menu.PartitionScheme.huge_app.upload.maximum_size=3145728

remalshabakahv4.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
remalshabakahv4.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
remalshabakahv4.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

remalshabakahv4.menu.PartitionScheme.zigbee_zczr=Zigbee ZCZR 4MB with spiffs
remalshabakahv4.menu.PartitionScheme.zigbee_zczr.build.partitions=zigbee_zczr
remalshabakahv4.menu.PartitionScheme.zigbee_zczr.upload.maximum_size=1310720

remalshabakahv4.menu.PartitionScheme.custom=Custom
remalshabakahv4.menu.PartitionScheme.custom.build.partitions=
remalshabakahv4.menu.PartitionScheme.custom.upload.maximum_size=16777216


remalshabakahv4.menu.CPUFreq.160=160MHz (WiFi)
remalshabakahv4.menu.CPUFreq.160.build.f_cpu=160000000L
remalshabakahv4.menu.CPUFreq.80=80MHz (WiFi)
remalshabakahv4.menu.CPUFreq.80.build.f_cpu=80000000L
remalshabakahv4.menu.CPUFreq.40=40MHz
remalshabakahv4.menu.CPUFreq.40.build.f_cpu=40000000L
remalshabakahv4.menu.CPUFreq.20=20MHz
remalshabakahv4.menu.CPUFreq.20.build.f_cpu=20000000L
remalshabakahv4.menu.CPUFreq.10=10MHz
remalshabakahv4.menu.CPUFreq.10.build.f_cpu=10000000L

