remalhq/Remal_ArduinoBoards/arch/esp32/1.3.0/boards.txt
## Remal - Disabled unused options
#remalshabakahv4.menu.FlashMode.qio=QIO
#remalshabakahv4.menu.FlashMode.qio.build.flash_mode=dio
#remalshabakahv4.menu.FlashMode.qio.build.boot=qio
remalshabakahv4.menu.FlashMode.dio=DIO
remalshabakahv4.menu.FlashMode.dio.build.flash_mode=dio
remalshabakahv4.menu.FlashMode.dio.build.boot=dio
#remalshabakahv4.menu.FlashMode.qout=QOUT
#remalshabakahv4.menu.FlashMode.qout.build.flash_mode=dout
#remalshabakahv4.menu.FlashMode.qout.build.boot=qout
#remalshabakahv4.menu.FlashMode.dout=DOUT
#remalshabakahv4.menu.FlashMode.dout.build.flash_mode=dout
#remalshabakahv4.menu.FlashMode.dout.build.boot=dout

remalshabakahv4.menu.FlashFreq.80=80MHz
remalshabakahv4.menu.FlashFreq.80.build.flash_freq=80m
remalshabakahv4.menu.FlashFreq.40=40MHz
remalshabakahv4.menu.FlashFreq.40.build.flash_freq=40m

remalshabakahv4.menu.FlashSize.4M=4MB (32Mb)
remalshabakahv4.menu.FlashSize.4M.build.flash_size=4MB

remalshabakahv4.menu.UploadSpeed.921600=921600
remalshabakahv4.menu.UploadSpeed.921600.upload.speed=921600
remalshabakahv4.menu.UploadSpeed.115200=115200
remalshabakahv4.menu.UploadSpeed.115200.upload.speed=115200
remalshabakahv4.menu.UploadSpeed.256000.windows=256000
remalshabakahv4.menu.UploadSpeed.256000.upload.speed=256000
remalshabakahv4.menu.UploadSpeed.230400.windows.upload.speed=256000
remalshabakahv4.menu.UploadSpeed.230400=230400
remalshabakahv4.menu.UploadSpeed.230400.upload.speed=230400
remalshabakahv4.menu.UploadSpeed.460800.linux=460800
remalshabakahv4.menu.UploadSpeed.460800.macosx=460800
remalshabakahv4.menu.UploadSpeed.460800.upload.speed=460800
remalshabakahv4.menu.UploadSpeed.512000.windows=512000
remalshabakahv4.menu.UploadSpeed.512000.upload.speed=512000

remalshabakahv4.menu.DebugLevel.none=None
remalshabakahv4.menu.DebugLevel.none.build.code_debug=0
remalshabakahv4.menu.DebugLevel.error=Error
remalshabakahv4.menu.DebugLevel.error.build.code_debug=1
remalshabakahv4.menu.DebugLevel.warn=Warn
remalshabakahv4.menu.DebugLevel.warn.build.code_debug=2
remalshabakahv4.menu.DebugLevel.info=Info
remalshabakahv4.menu.DebugLevel.info.build.code_debug=3
remalshabakahv4.menu.DebugLevel.debug=Debug
remalshabakahv4.menu.DebugLevel.debug.build.code_debug=4
remalshabakahv4.menu.DebugLevel.verbose=Verbose
remalshabakahv4.menu.DebugLevel.verbose.build.code_debug=5

remalshabakahv4.menu.EraseFlash.none=Disabled
remalshabakahv4.menu.EraseFlash.none.upload.erase_cmd=
remalshabakahv4.menu.EraseFlash.all=Enabled
remalshabakahv4.menu.EraseFlash.all.upload.erase_cmd=-e

remalshabakahv4.menu.ZigbeeMode.default=Disabled
remalshabakahv4.menu.ZigbeeMode.default.build.zigbee_mode=
remalshabakahv4.menu.ZigbeeMode.default.build.zigbee_libs=
remalshabakahv4.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator/router)
remalshabakahv4.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
remalshabakahv4.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api_zczr -lesp_zb_cli_command -lzboss_stack.zczr -lzboss_port

##############################################################
#
# Shabakah (Founders Edition)
#
##############################################################
remalshabakahfe.name=Shabakah (Founders Edition)
remalshabakahfe.vid.0=0x303A
remalshabakahfe.pid.0=0x1001

remalshabakahfe.bootloader.tool=esptool_py
remalshabakahfe.bootloader.tool.default=esptool_py

remalshabakahfe.upload.tool=esptool_py
remalshabakahfe.upload.tool.default=esptool_py
remalshabakahfe.upload.tool.network=esp_ota

remalshabakahfe.upload.maximum_size=1310720
remalshabakahfe.upload.maximum_data_size=327680
remalshabakahfe.upload.flags=
remalshabakahfe.upload.extra_flags=
remalshabakahfe.upload.use_1200bps_touch=false
remalshabakahfe.upload.wait_for_upload_port=false

remalshabakahfe.serial.disableDTR=false
remalshabakahfe.serial.disableRTS=false

remalshabakahfe.build.tarch=riscv32
remalshabakahfe.build.target=esp
remalshabakahfe.build.mcu=esp32c3
remalshabakahfe.build.core=esp32
remalshabakahfe.build.variant=shabakah_fe
remalshabakahfe.build.board=SHABAKAH_FE
remalshabakahfe.build.bootloader_addr=0x0

remalshabakahfe.build.cdc_on_boot=0
remalshabakahfe.build.f_cpu=160000000L
remalshabakahfe.build.flash_size=4MB
remalshabakahfe.build.flash_freq=80m
remalshabakahfe.build.flash_mode=dio
remalshabakahfe.build.boot=dio
remalshabakahfe.build.partitions=min_spiffs
remalshabakahfe.build.defines=

## IDE 2.0 Seems to not update the value
remalshabakahfe.menu.JTAGAdapter.default=Disabled
remalshabakahfe.menu.JTAGAdapter.default.build.copy_jtag_files=0
remalshabakahfe.menu.JTAGAdapter.builtin=Integrated USB JTAG
remalshabakahfe.menu.JTAGAdapter.builtin.build.openocdscript=esp32c3-builtin.cfg
remalshabakahfe.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
remalshabakahfe.menu.JTAGAdapter.external=FTDI Adapter
remalshabakahfe.menu.JTAGAdapter.external.build.openocdscript=esp32c3-ftdi.cfg
remalshabakahfe.menu.JTAGAdapter.external.build.copy_jtag_files=1
remalshabakahfe.menu.JTAGAdapter.bridge=ESP USB Bridge
remalshabakahfe.menu.JTAGAdapter.bridge.build.openocdscript=esp32c3-bridge.cfg
remalshabakahfe.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

## Remal - Updated to Enabled as default to allow using USB with Arduino Serial calls
remalshabakahfe.menu.CDCOnBoot.default=Enabled
remalshabakahfe.menu.CDCOnBoot.default.build.cdc_on_boot=1
remalshabakahfe.menu.CDCOnBoot.cdc=Disabled
remalshabakahfe.menu.CDCOnBoot.cdc.build.cdc_on_boot=0

# Partitions
remalshabakahfe.menu.PartitionScheme.default=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
remalshabakahfe.menu.PartitionScheme.default.build.partitions=min_spiffs
remalshabakahfe.menu.PartitionScheme.default.upload.maximum_size=1966080

#-- Below is ESP default for ESP32C3 by Espressif changed the default --
remalshabakahfe.menu.PartitionScheme.esp_default= 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
remalshabakahfe.menu.PartitionScheme.esp_default.build.partitions=default

remalshabakahfe.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
remalshabakahfe.menu.PartitionScheme.defaultffat.build.partitions=default_ffat

