remalhq/Remal_ArduinoBoards/arch/esp32/1.3.0/boards.txt
remalshabakahfe.menu.PartitionScheme.no_fs=No FS 4MB (2MB APP x2)
remalshabakahfe.menu.PartitionScheme.no_fs.build.partitions=no_fs
remalshabakahfe.menu.PartitionScheme.no_fs.upload.maximum_size=2031616

remalshabakahfe.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
remalshabakahfe.menu.PartitionScheme.minimal.build.partitions=minimal

remalshabakahfe.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
remalshabakahfe.menu.PartitionScheme.no_ota.build.partitions=no_ota
remalshabakahfe.menu.PartitionScheme.no_ota.upload.maximum_size=2097152

remalshabakahfe.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
remalshabakahfe.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
remalshabakahfe.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576

remalshabakahfe.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
remalshabakahfe.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
remalshabakahfe.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152

remalshabakahfe.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
remalshabakahfe.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
remalshabakahfe.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576

remalshabakahfe.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
remalshabakahfe.menu.PartitionScheme.huge_app.build.partitions=huge_app
remalshabakahfe.menu.PartitionScheme.huge_app.upload.maximum_size=3145728

remalshabakahfe.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
remalshabakahfe.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
remalshabakahfe.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

remalshabakahfe.menu.PartitionScheme.zigbee_zczr=Zigbee ZCZR 4MB with spiffs
remalshabakahfe.menu.PartitionScheme.zigbee_zczr.build.partitions=zigbee_zczr
remalshabakahfe.menu.PartitionScheme.zigbee_zczr.upload.maximum_size=1310720

remalshabakahfe.menu.PartitionScheme.custom=Custom
remalshabakahfe.menu.PartitionScheme.custom.build.partitions=
remalshabakahfe.menu.PartitionScheme.custom.upload.maximum_size=16777216


remalshabakahfe.menu.CPUFreq.160=160MHz (WiFi)
remalshabakahfe.menu.CPUFreq.160.build.f_cpu=160000000L
remalshabakahfe.menu.CPUFreq.80=80MHz (WiFi)
remalshabakahfe.menu.CPUFreq.80.build.f_cpu=80000000L
remalshabakahfe.menu.CPUFreq.40=40MHz
remalshabakahfe.menu.CPUFreq.40.build.f_cpu=40000000L
remalshabakahfe.menu.CPUFreq.20=20MHz
remalshabakahfe.menu.CPUFreq.20.build.f_cpu=20000000L
remalshabakahfe.menu.CPUFreq.10=10MHz
remalshabakahfe.menu.CPUFreq.10.build.f_cpu=10000000L

## Remal - Disabled unused options
#remalshabakahfe.menu.FlashMode.qio=QIO
#remalshabakahfe.menu.FlashMode.qio.build.flash_mode=dio
#remalshabakahfe.menu.FlashMode.qio.build.boot=qio
remalshabakahfe.menu.FlashMode.dio=DIO
remalshabakahfe.menu.FlashMode.dio.build.flash_mode=dio
remalshabakahfe.menu.FlashMode.dio.build.boot=dio
#remalshabakahfe.menu.FlashMode.qout=QOUT
#remalshabakahfe.menu.FlashMode.qout.build.flash_mode=dout
#remalshabakahfe.menu.FlashMode.qout.build.boot=qout
#remalshabakahfe.menu.FlashMode.dout=DOUT
#remalshabakahfe.menu.FlashMode.dout.build.flash_mode=dout
#remalshabakahfe.menu.FlashMode.dout.build.boot=dout

remalshabakahfe.menu.FlashFreq.80=80MHz
remalshabakahfe.menu.FlashFreq.80.build.flash_freq=80m
remalshabakahfe.menu.FlashFreq.40=40MHz
remalshabakahfe.menu.FlashFreq.40.build.flash_freq=40m

remalshabakahfe.menu.FlashSize.4M=4MB (32Mb)
remalshabakahfe.menu.FlashSize.4M.build.flash_size=4MB

remalshabakahfe.menu.UploadSpeed.921600=921600
remalshabakahfe.menu.UploadSpeed.921600.upload.speed=921600
remalshabakahfe.menu.UploadSpeed.115200=115200
remalshabakahfe.menu.UploadSpeed.115200.upload.speed=115200
remalshabakahfe.menu.UploadSpeed.256000.windows=256000
remalshabakahfe.menu.UploadSpeed.256000.upload.speed=256000
remalshabakahfe.menu.UploadSpeed.230400.windows.upload.speed=256000
remalshabakahfe.menu.UploadSpeed.230400=230400
remalshabakahfe.menu.UploadSpeed.230400.upload.speed=230400
remalshabakahfe.menu.UploadSpeed.460800.linux=460800
remalshabakahfe.menu.UploadSpeed.460800.macosx=460800
remalshabakahfe.menu.UploadSpeed.460800.upload.speed=460800
remalshabakahfe.menu.UploadSpeed.512000.windows=512000
remalshabakahfe.menu.UploadSpeed.512000.upload.speed=512000

remalshabakahfe.menu.DebugLevel.none=None
remalshabakahfe.menu.DebugLevel.none.build.code_debug=0
remalshabakahfe.menu.DebugLevel.error=Error
remalshabakahfe.menu.DebugLevel.error.build.code_debug=1
remalshabakahfe.menu.DebugLevel.warn=Warn
remalshabakahfe.menu.DebugLevel.warn.build.code_debug=2
remalshabakahfe.menu.DebugLevel.info=Info
remalshabakahfe.menu.DebugLevel.info.build.code_debug=3
remalshabakahfe.menu.DebugLevel.debug=Debug
remalshabakahfe.menu.DebugLevel.debug.build.code_debug=4
remalshabakahfe.menu.DebugLevel.verbose=Verbose
remalshabakahfe.menu.DebugLevel.verbose.build.code_debug=5

remalshabakahfe.menu.EraseFlash.none=Disabled
remalshabakahfe.menu.EraseFlash.none.upload.erase_cmd=
remalshabakahfe.menu.EraseFlash.all=Enabled
remalshabakahfe.menu.EraseFlash.all.upload.erase_cmd=-e

remalshabakahfe.menu.ZigbeeMode.default=Disabled
remalshabakahfe.menu.ZigbeeMode.default.build.zigbee_mode=
remalshabakahfe.menu.ZigbeeMode.default.build.zigbee_libs=
remalshabakahfe.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator/router)
remalshabakahfe.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
remalshabakahfe.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api_zczr -lesp_zb_cli_command -lzboss_stack.zczr -lzboss_port


##############################################################
